package shivam.com.isitso;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;

public class MainActivity extends AppCompatActivity {

    String topic,data;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
    }



    public void showSachin(View v){
        topic= "Scahin";
        data="1. सचिन के पिता रमेश तेंदुलकर ने प्रसिद्ध संगीतकार \"सचिन देव बरमन\" के नाम पर अपने बेटे का नाम रखा था।\n" +
                "2. सचिन एक fast bowler बनना चाहते थे मगर ऐसा नहीं हो सका।\n" +
                "3. सचिन को प्रैक्टिस कराते समय उनके कोच स्टंप पर एक सिक्का रख देते थे और दुसरे खिलाड़ियों को कहते कि वह सचिन को बोंलिंग करें। जो खिलाड़ी सचिन को आउट कर देंगा सिक्का उसका,अगर सचिन को कोई भी खिलाड़ी आउट न कर सके तो सिक्का सचिन का होता था। सचिन के पास आज भी उनमें से 13 सिक्के हैं।\n" +
                "4. सचिन टेस्ट क्रिकेट में 14000 से अधिक रन बनाने वाले वह विश्व के एकमात्र खिलाड़ी हैं।\n" +
                "5. सचिन ने अपने अन्तर्राष्ट्रीय खेल की शुरुआत सन् 1989 में पाकिस्तान के खिलाफ कराची से की थी।\n" +
                "6. सचिन के पिता रमेश तेंडुलकर एक मराठी शिक्षक व कवि और मां रजनी हाउस वाइफ थी।\n" +
                "7. सचिन ने 11 साल की उम्र में पहली बार क्रिकेट बैट थामा था।\n" +
                "8. आप यकीन नहीं करेंगे लेकिन एक बार सचिन जब छत पर खेल रहे थे तभी ऊपर से एक हैलीकाॅपटर गुजरा और उनकी उंगली कट गई थी ।\n" +
                "9. सचिन तेंदुलकर अपने पिता रमेश तेंदुलकर की दूसरी पत्\u200Dनी के पुत्र है। जी हां उनके पिता ने दो शादियां की है।\n" +
                "10. स्कूल में सचिन अपने दोस्तों के साथ वड़ा पाव खाने का कॉम्पीटीशन रखते थे।\n" +
                "11. स्कूल में एक बार उनके अच्छे दोस्त अतुल रानाडे ने उनके घुंघराले बालों के कारण उन्हें लड़की समझ लिया था।\n" +
                "12. सन् 1988 में मुंबई के ब्रेबॉर्न स्टेडियम में खेले गए एक दिवसीय अभ्यास मैच में सचिन तेंदुलकर ने पाकिस्तान के लिए फ़ील्डिंग की थी।\n" +
                "13. आप को शायद हँसी आएँगी यह जानकार की सचिन को नींद में चलने की बीमारी है। एक बार एक इंटरव्यू के दौरान उन्होंने इस बात का खुलासा किया था।\n" +
                "14. सचिन भले ही खेलते दाए हाथ से है लेकिन Autograph देने के लिए वे बायें हाथ का इस्तेमाल करते हैं।\n" +
                "15. सन् 1995 में सचिन नकली मूंछ-दाढ़ी और चश्मा लगाकर फ़िल्म ‘रोजा’ देखने गए थे, लेकिन उनका चश्मा गिरते ही सिनेमा हॉल में मौजदू लोगों ने उन्हें पहचान लिया था।\n" +
                "16. पता नहीं क्यों लेकिन सचिन जब कभी भी टीम के साथ बस में होते हैं तो वे हमेशा पहली लाइन में बायीं तरफ की खिड़की वाली सीट पर ही बैठते हैं।\n" +
                "17. सचिन 14 साल की उम्र में मुंबई की Ranji Team में शामिल होने वाले वे पहले खिलाड़ी थे।\n" +
                "18. सचिन ने पाकिस्तान के ख़िलाफ़ अपने पहले टेस्ट मैच में सुनील गावस्कर से भेंट में मिले पैड्स को पहन कर ही खेला था।\n" +
                "19. सचिन ने रणजी, दलीप और ईरानी ट्राफ़ी के अपने पहले ही मैचों में शतक जमाए है। ऐसा करने वाले वे भारत के एकमात्र बल्लेबाज़ हैं। इतना ही नहीं उनका यह रिकॉर्ड आज तक कायम है।\n" +
                "20. आप इसे संयोग माने या कुछ और लेकिन सचिन ने अपने ज्यादातर बड़े स्कोर होली, रक्षा बंधन और दीपावली जैसे भारतीय त्योहारों पर ही बनाए हैं।\n" +
                "21. सचिन ने 13 साल की उम्र में शारदा आश्रम स्कूल की तरफ से खेलते हुए विनोद कांबली के साथ मिलकर 664 रनों की साझेदारी का विश्व रिकॉर्ड बनाया था।\n" +
                "22. सचिन ने अपने शुरुआती दौर में बहुत संघर्ष किया था। सचिन के पास एक ही क्रिकेट ड्रेस थी, जिसे रोज शाम को धोकर वह जब सुबह प्रैक्टिस पर जाते तो जेब गीली ही रह जाती थीं। सचिन आज भी उन दिनों की याद करते है।\n" +
                "23. आप भले ही ना माने लेकिन सचिन दिन में 16 घंटे नेट पे प्रैक्टिस करते थे।\n" +
                "24. आपको शायद ही मालुम होंगा की सचिन ने 79 मैंचों के बाद पहली One-Day सेंचुरी बनाई थी।\n" +
                "25. सचिन क्रिकेट जगत में ऐसे पहले बल्लेबाज हैं जिन्हें थर्ड अंपायर ने पहली बार रिप्लाई देखकर आउट दिया था। उन्हें यह रन आउट जॉंटी रोड्स के थ्रो पर मिला था।\n" +
                "26. सचिन को सबसे ज्यादा बार 'मैन ऑफ द मैच' और 'मैन ऑफ द सीरीज' का ख़िताब मिला है। उन्हें 62 बार 'मैन ऑफ द मैच और 15 बार 'मैन ऑफ द सीरीज' का अवार्ड मिल चूका है।\n" +
                "27. सचिन को सन् 1999 में 'पद्मश्री', सन् 2001 में महाराष्ट्र भूषण पुरस्कार, सन् 2008 में पद्म विभूषण, और सन् 2014 में भारत का सर्वोच्च नागरिक पुरस्कार \" भारत रत्न\" भी मिल चुका है।\n" +
                "28. वर्ल्डकप में भी सचिन रिकॉर्ड के बादशाह रहे है। सबसे अधिक रन (2273 रन), सबसे ज्यादा अर्धशतक (15), सर्वाधिक शतक (6) बनाने के सारे रिकॉर्ड भी सचिन के नाम पर ही है।\n" +
                "29. एक कैलेंडर वर्ष में 1000 रन बनाने का कारनामा भी सचिन सात बार कर चुके हैं।\n" +
                "30. सचिन को सिडनी के क्रिकेट ग्राउंड पर खेलना सबसे ज़्यादा पसंद है।";
        callActivity();
    }



    public void showKhali(View v){
        topic= "The Great Khali";
        data= "1. खली का जन्म 27 अगस्त 1972 में हिमाचल प्रदेश में हुआ था।\n" +
                "2. द ग्रेट खली का असली नाम \"Dalip Singh Rana\" है।\n" +
                "3. खली बहुत ही लंबे है उनकी लंबाई करीब 7.1 ft है यानी की 2.16 मीटर।\n" +
                "4. सन् 2014 में दुनिया के अब तक के 8 सबसे लंबे रेसलरो की सूचि में खली का भी नाम था।\n" +
                "5. आपको शायद ही मालुम होंगा की खली शिमला में सिक्योरिटी गार्ड की नौकरी भी कर चुके है।\n" +
                "6. एक समय ऐसा भी था जब खली अपनी विशाल कद काठी की वजह से उनके पैरो की नाप के जूते बाजार में नही मिल पाते थे इसलिए वो बाजार में मोची से अपने नाप के जूते बनवाकर पहनते थे |\n" +
                "7. द ग्रेट खली पंजाब पुलिस में ऑफिसर भी रह चुके है।\n" +
                "8. 1990 के दशक में रेसलिंग अमेरिका में बहुत पोपुलर थी लेकिन भारत का कोई भी रेसलर वहा पर टिक नही पाया था इसलिए खली ने प्रोफेशनल रेसलर की ट्रेनिंग लेकर एक रेसलर बनने की ठानी।\n" +
                "9. सन् 2000 में अमेरिका के All Pro Wrestling (APW) में खली ने डेब्यू किया था।\n" +
                "10. उस समय उन्हें रिंग में \"Giant Singh\" के नाम से जाना जाता है।\n" +
                "11. WWE में जाने से पहले सन् 2006 तक खली All Japan Pro Wrestling में शामिल थे।\n" +
                "12. सन् 2006 में ही खली World Wrestling Entertainment (WWE) में शामिल होने वाले भारत के पहले प्रोफेशनल रेसलर बने |\n" +
                "13. WWE में खली का पहला मुकाबला The Undertaker से हुआ था। मगर इस मैच में कोई नहीं जीत पाया था।\n" +
                "14. WWE में खली को अपनी पहली जीत Funaki को हराकर मिली थी।\n" +
                "15. पहली जीत से ही उन्हें \"The Great Khali\" के नाम से जाना जाने लगा।\n" +
                "16. खली दानवीर भी है उन्होंने अपनी कमाई का कुछ हिस्सा अपने गाँव के आर्थिक विकास में भी लगाया है।\n" +
                "17. द ग्रेट खली रोज शाम को 10 लीटर दूध , 20 उबले हुए अंडे , 5 ग्लास मिक्स जूस और 5 ग्लास अनार का जूस पीते है।\n" +
                "18) 1997-98 में खली ने मि .यूपी रहे अर्णव बेनर्जी और मो.सगीर को अपने बाइसेप्स से लटकाकर व्यायाम करवाया था।\n" +
                "19. आपको यकीन नहीं होंगा लेकिन एक बार खली किसी दोस्त के यहाँ मेहमान बन कर रुके तो वो 10 मिनट के अंदर 40 रोटियाँ , 4 किलो सब्जी और 8 कटोरे दाल पी गए। तो दोस्त की पत्नी ने उनके पति से कहा “इनको वापस लेकर कभी मत आना ”।\n" +
                "20. खली माँ काली के परमभक्त है इतना ही नहीं रिंग में भी खली माँ काली बोलकर फाइट करते थे।\n" +
                "21. एक बार The Great Khali जब होटल में खाना खाकर वापस अपने कमरे में लौट रहे थे तब उनका पैर 40 प्लेटो पर पड़ गया और वो सभी प्लेटे एक सेकंड में चकनाचूर हो गयी |\n" +
                "22. खली ने दो बॉलीवुड और चार हॉलीवुड फिल्मो में काम किया है। मगर अपनी आवाज़ की वजह से वह फिल्मो में ज़्यादा फेमस नहीं हो सके।\n" +
                "23. खली शराब और धूम्रपान से सख्त नफरत है।\n" +
                "24. भारत के रियलिटी शो बिग बॉस में भी खली ने अक्टूबर 2010 में शिरकत की थी। आपको यह जानकार हैरानी होंगी की बिग बॉस में खली के लिए खास तौर पर एक बेड को बनाया गया था जो उनके वजन और कद दोनों को संभाल सके।\n" +
                "25. खली ने सन् 2015 में खुदका एक रेसलिंग स्कूल भी खोला है जो पंजाब में है।\n" +
                "26. खली की कुल संपत्ति करीब $60,00,000 डॉलर है।";
        callActivity();
    }

    public void showAmerica(View v){
        topic= "America";
        data= "1. आपको शायद ही पता होंगा की पहले अमेरिका भी भारत की तरह इंग्लैंड का गुलाम था उसे " +
                "4 जुलाई 1776 में \"जॉर्ज वाशिंगटन\" ने आजाद कराया था।\n" +
                "2. अमेरिका में कुल 50 राज्य है। जिनमे से 48 जुड़े हुए है जबकि 2 राज्य अलास्का और हवाई अलग है।\n" +
                "3. हर चार में से एक अमरीकी T.V. पर किसी न किसी शो में कही न कही आया हुआ है।\n" +
                "4. अमेरिका में 5,26,00,000 से भी ज़्यादा कुत्ते हैं।\n" +
                "5. प्रत्येक अमरीकी एक साल में 600 Cold Drinks पी जाता है।\n" +
                "6. अमेरिका के पूरे 50 राज्यो के नाम में अंग्रेजी के सारे अल्फाबेट्स है सिवाय \"Q\" के।\n" +
                "7. अमेरिका में हर साल 8,50,00,000 टन काग़ज का इस्तेमाल होता है।\n" +
                "8. अमेरिका ने अलास्का को रूस से खरीदने के लिए केवल 72 लाख डॉलर दिए थे। आज के हिसाब से 1 रूपया प्रति एकड़ बनता है। इतना ही नहीं अलास्का की ज़मीन आज सोना उगलती है।\n" +
                "9. अमेरिका की सबसे ऊँची पर्वत चोटी का नाम \"माउंट मैककिनल\" है। इसकी ऊँचाई 6,194 मीटर है।\n" +
                "10. एक अनुमान के मुताबिक हर अमरीकी अपने पुरे जीवन के दौरान 465 पेड़ो के बराबर कागज़ का उपयोग करता है।\n" +
                "11. मशहूर \"Statue of Liberty\" को सन् 1884 में फ्रांस ने अमेरिका को उपहार में दिया था।\n" +
                "12. अमेरिका का सबसे ज्यादा आबादी वाला शहर न्युयार्क है।\n" +
                "13. आप यकीन नहीं करेंगे मगर अमेरिका के मोंटाना शहर में पशुओ की संख्या मनुष्यों से 3 गुना ज्यादा है।\n" +
                "14. अमेरिका की 33% आबादी मोटापे का शिकार है।\n" +
                "15. आपको शायद ही पता होंगा की भारतीयों को सन् 1924 तक अमेरिका की नागरिकता लेने का अधिकार नही था। और आज भारतीय मूल के सूंदर पिचाई गूगल जैसी कंपनी के सीईओ है।\n" +
                "16. अमेरिका की हवाई सेना दुनिया की सबसे बड़ी हवाई सेना है और जल सेना दुनिया की दूसरी सबसे बड़ी जल सेना है।\n" +
                "17. अमेरिका में हर साल 50 लाख साइकिलो को ऐसे ही फेंक दिया जाता है।\n" +
                "18. अमेरिका के लोग अपनी आमदनी का 1% ही बचाते है बाकी का 99% या तो वह खर्च कर देते है या दान कर देते है।\n" +
                "19. अमेरिका में हर साल 1 करोड 50 लाख से भी ज़्यादा हॉट डॉग खाए जाते है।\n" +
                "20. आपको जानकार हैरानी होंगी की हर 45 सैकेंड में अमेरिका का एक न एक घर आग से जल जाता है।\n" +
                "21. अमरीकी हर साल 4 करोड़ 20 लाख से भी ज़्यादा चेक साइन करते हैं। सोचिये अमेरिका में कितना पैसा है।\n" +
                "22. अमेरिका में हर साल करीब 55 अरब डॉलर का जुआ खेला जाता है।\n" +
                "23. प्रत्येक अमरीकी अपना 90% समय घर के अंदर खर्च करता है।\n" +
                "24. अमेरिका में हर साल 25 लाख से भी ज़्यादा प्लास्टिक की बोतलें फेंकी जाती है।\n" +
                "25. एक औसत अमेरिकी इतना पिज़्ज़ा खा जाता है कि उसे अगर ज़मीन पर बिछाया जाए तो वह 18 एकड़ तक फैल जाएंगा।\n" +
                "26. दुनिया में सबसे ज़्यादा आइसक्रीम अमेरिका में ही खाई जाती है।\n" +
                "27. अमेरिका में पास्ता की सालाना खपत 35000 टन है।\n" +
                "28. अमेरिका में हर साल 800 से भी ज़्यादा चक्रवात आते है।\n" +
                "29. अमेरिका में हर रोज 4 करोड़ 40 लाख अखबार पढ़ के फेंक दिए जाते है।\n" +
                "30. अमेरिका की लगभग हर महिला का औसतन वजन 50 किलोग्राम है।\n" +
                "31. अमेरिका में शादी करने वाले हर 8 जोड़ों में से 1 जोड़ा ऐसा होता है जिन्हें एक साल पहले Online प्यार हुआ था।\n" +
                "32. 18% अमेरिकी अभी भी यह मानते हैं कि सुर्य धरती का चक्कर लगाता है।\n" +
                "33. अमेरिका में आप 16 साल की उम्र होने पर ही कार चला सकते हैं ,18 की उम्र होने पर ही पिस्तौल रख सकते है और वोट डाल सकते है और 21 की उम्र होने पर ही शराब खरीद सकते हैं।";
        callActivity();
    }

    public void showSamsung(View v){
        topic= "Samsung";
        data= "1 . सैमसंग दुनिया क़ि सबसे बड़ी आईटी कंपनी है।\n" +
                "2 . सैमसंग के संस्थापक ली बयुंग चुल ने 1938 में कंपनी की स्थापना की थी।\n" +
                "3 . सैमसंग ने सबसे पहले groceries और noodles बेचना शुरू किया था, उस समय कंपनी में केवल 40 कर्मचारी ही थे।\n" +
                "4 . सैमसंग ने 1970 में पहली बार 12 इंच का black and white टीवी लांच किया था | सैमसंग ने फिर 1983 में पहला कंप्यूटर और 1985 में फ़ोन शुरू किया था।\n" +
                "5 .1995 में कंपनी क़ि गुड़वत्ता को बढाने के लिए कंपनी ने 150,000 सैमसंग के devices को सुधारने के लिए उपभोक्ताओं से वापस मंगवा लिया था।\n" +
                "6 . कंपनी अपने सामान क़ी गुड़वत्ता को बरकरार रखने के लिए 90% सामान अपनी खुद क़ी कंपनी में ही बनाती है।\n" +
                "7 . 2012 में global brand क़ी सूचि में सैमसंग 9वे स्थान पर था।\n" +
                "8 . पूरी दुनिया में बिकने वाले स्मार्टफोन में से हर तीसरा फ़ोन सैमसंग का होता है।\n" +
                "9 . हर मिनट में सैमसंग के करीबन 100 टेलीविज़न बिक जाते है।\n" +
                "10 . पूरी दुनिया में सैमसंग के 33 R&D केंद्र है जिसमे engineers कंपनी के सामान को और बेहतर बनाने और टेक्नोलॉजी को और एडवांस करने के लिए शोध करते रहते है।\n" +
                "11 . सैमसंग ने 2015 में $14.1 बिलियन R$D पर खर्च किया था जबकि एप्पल ने $6 बिलियन और गूगल ने $9.8 खर्च किया था।\n" +
                "12 . आज के समय में सैमसंग करीबन 80 तरह का व्यापार कर रहा है जिसमे जहाज बनाना और क्रेन्स बनाना भी शामिल है।\n" +
                "13 . \"samsung digital city\" जो क़ी 389 एकड़ में फैला है में 3 तो लंबी इमारते है और 131 छोटी इमारते है। इसमें 35,000 लोग काम करते है।\n" +
                "14 . सैमसंग हर साल 100 मिलियन डॉलर चिकित्सा सेवा के लिए दान में दे देता है।\n" +
                "15 . जब से सैमसंग क़ी स्थापना हुई है तब से इसका logo सिर्फ तीन बार बदला गया है।\n" +
                "16 . सैमसंग ने पहला PDA फ़ोन 2001 में निकाला था जिसका नाम PH-i300 था।\n" +
                "17 . एप्पल के iphones में लगने वाली सारी chip सैमसंग ही बनाता है।\n" +
                "18 . कोरिया क़ी कुल GDP का 17 प्रतिशत योगदान अकेला सैमसंग करता है।\n" +
                "19 . सैमसंग फ्रीज़(रेफ्रिजेटर) के उत्पादन में भी नंबर 1 पर आता है।\n" +
                "20 . सैमसंग हर साल करीबन 5000 पेटेंट अमेरिका में और 2500 पेटेंट यूरोप में करता है।";
        callActivity();
    }

    public void showUndertaker (View v){
        topic= "Undertaker ";
        data= "1. Undertaker का जन्म 24 मार्च 1965 में हुआ था। यानी की वह 51 साल के हो चुके है फिर भी लड़ रहे है।\n" +
                "2. Undertaker को \"Don Jardine\" ने ट्रेनिंग दी है।\n" +
                "3. Undertaker का असली नाम \"Mark William Calaway\" है।\n" +
                "4. Undertaker ने रेसलिंग में अपने करियर की शुरुआत सन् 1984 में की थी।\n" +
                "5. Undertaker अपनी पहली ही फाइट ब्रूसर बॉडी से हार गए थे। पर इसके बाद कभी भी ब्रूसर बॉडी अंडरटेकर को नही रहा सके।\n" +
                "6. Undertaker हॉलीवुड की फिल्म ‘सुबर्बन कमांडो’ और ‘बियांड हयैट’ के साथ-साथ तीन Tv shows में भी काम कर चुके है।\n" +
                "7. Undertaker WWE के रेसेलमेनिया इवेंट में केवल एक ही बार हारे हैं।\n" +
                "8. अंडरटेकर ने रेसेलमेनिया में लगातार 21 फाइट जीती थी जो कि एक रिकार्ड है। आपको बता दे की 22 वे मैच में ब्रोक लेसनर ने उन्हें हराकर इस रिकॉर्ड को रोक दिया था।\n" +
                "9. अंडरटेकर ने तीन शादियां की है जिनसे उन्हें 4 बच्चे हैं। उन्हें एक बेटा \"गुनर विसेंट\" है और तीन बेटियां है जिनके नाम चासे,ग्रैसी और किया फैथ है।\n" +
                "10. Undertaker अपने रेसलिंग करियर में 750 से ज्यादा मुकाबले लड़े है। इनमे से 67% में उन्हें जीत मिली, 24% में हार और बाकी के मुकाबले ड्रा रहे।\n" +
                "11. WWE में Undertaker ने 100 से ज्यादा खिताब जीते है।\n" +
                "12. आपको शायद ही पता होंगा कि WWE एक और स्टार \"केन(Kane)\" अंडरटेकर के सौतेले भाई हैं, और दोनों भाईयो की टीम को ‘ब्रदर ऑफ डिस्ट्रक्शन’ कहा जाता है।\n" +
                "13. इतना ही नहीं Undertaker और Kane दोनों भाई सात बार टैग टीम के चैम्पियन भी रह चुके है।\n" +
                "14. Undertaker को \"Wrestle-Mania\" में पहली जीत \"Jimmy Snuka\" के खिलाफ मिली थी।\n" +
                "15. एक रेसलर बनने से पहले अंडरटेकर बास्केटबॉल खेलते थे इतना ही नहीं वह एक बेहतरीन बास्केटबॉल प्लेयर थे।\n" +
                "16. आपको शायद ही पता होंगा की Big Boot ,Deadman Walking ,Chokeslam और Last ride यह सभी Undertaker के पसंदीदा रेसलिंग मूव्स है जो वो अक्सर करते भी है।\n" +
                "17. Undertaker को आपने रिंग में आते वक़्त बाइक पर देखा होंगा उनका एंट्री करने का यह स्टाइल उनके फैंस को काफी पसंद आया था। और यह बहुत लोकप्रिय भी हुआ था।\n" +
                "18. Undertaker मार्टिअल आर्ट भी अच्छे से जानते है। अब आप समझ गए होंगे की उनके नाम इतने रिकॉर्ड क्यों है।\n" +
                "19. अंडरटेकर ने दिसंबर, 1991 से सितंबर 1993 तक बिना कोई मैच गवाए तीन बार वर्ल्ड हैवीवेट चैम्पियनसिप का खिताब भी जीता है। यह एक विश्व रिकॉर्ड हैं।\n" +
                "20. Undertaker को ‘डेडमैन’ और ‘द अमेरिकन एस’ के नाम से भी जाना जाता है।\n" +
                "21. आपको यकीन नहीं होंगा लेकिन अंडरटेकर बहुत धार्मिक है।\n" +
                "22. Undertaker ने एक बार अपना घर ब्रैड पिट और एंजेलिना जोली को किराए पर दिया था।\n" +
                "23. Undertaker को 5 बार \"Pro Wrestling Illustrated Award\" मिला है।\n" +
                "24. Undertaker ने अपनी सबसे लंबी मैच Triple H से लड़ी थी यह फाइट 30 मिनट और 52 सेकंड की थी।\n" +
                "25. Undertaker को 16 वीडियो गेम्स के कवर पेज पर रखा जा चूका है। वह Triple H के बाद दूसरे WWE सुपरस्टार है जिन्हें इतने गेम्स के कवर पेज पर जगह मिली है।";
        callActivity();
    }

    public void showKalamJi(View v){
        topic= "Abdul Kalam ji";
        data= "1. अब्दुल कलाम भारत के ग्यारहवें और पहले गैर-राजनीतिज्ञ राष्ट्रपति थे। ये पद उन्हें तकनीकी एवं विज्ञान में विशेष योगदान की वजह से मिला था|\n" +
                "2. अब्दुल कलाम राष्ट्रपति होंने के साथ साथ एक इंजिनियर और एक वैज्ञानिक भी थे।\n" +
                "3. बहुत कम लोगो को पता है कि अब्दुल कलाम का पूरा नाम \"डॉक्टर अवुल पकिर जैनुल्लाब्दीन अब्दुल कलाम\" था।\n" +
                "4. अब्दुल कलाम के मन में देशभक्ति बचपन से ही थी वह एक फाइटर पॉयलेट बनना चाहते थे।\n" +
                "5. अब्दुल कलाम जी के पिता ज्यादा पढ़े लिखे नहीं थे। वे मछुआरों को नाव किराये पर दिया करते थे।\n" +
                "6. अब्दुल कलाम जी ने 8 साल की उम्र में ही सुबह 4 बजे उठना शुरू कर दिया था। और रोज़ 4 बजे स्नान करने के बाद वह ट्यूशन चले जाते थे।\n" +
                "7. अब्दुल कलाम के अध्यापक स्वामीयर कलाम के साथ साथ पाँच और विद्यार्थियों को नि:शुल्क ट्यूशन पढ़ाते थे। क्योकि उन्हें लगता था कि यह लोग ज़रूर कुछ करेंगे।\n" +
                "8. आर्थिक तंगी के कारण डॉक्टर अब्दुल कलाम बचपन में “अखबार” भी बांटा करते थे।\n" +
                "9. इतना ही नहीं उनकी हालत इतनी खराब थी की वह इमली और इमली के बीज भी बेचते थे।\n" +
                "10. सन् 1992 से सन् 1999 तक कलाम रक्षा मंत्री के रक्षा सलाहकार भी रह चुके थे।\n" +
                "11. परमाणु हथियार बनाने वाले देशों की सूचि में भारत को शामिल करने के लिए अब्दुल कलाम का बहुत बड़ा योगदान रह चुका है।\n" +
                "12. अब्दुल कलाम जी को वर्ष 1997 में देश के सर्वोच्च नागरिक पुरुस्कार \"भारत रत्न\" से नवाजा गया था। आपको बता दें की डॉ. सर्वपल्ली राधाकृष्ण और डॉ जाकिर हुसैन के बाद कलाम ही एक ऐसे व्यक्ति हैं, जिन्हें भारत रत्न मिलने के बाद राष्ट्रपति का पद मिला था।\n" +
                "13. अपने करियर की शुरुआत में ही अब्दुल कलाम जी ने इंडियन आर्मी के लिए एक स्माल हेलीकाप्टर डिजाईन किया था।\n" +
                "14. अब्दुल कलाम जी हमेशा अपनी सफलता का श्रेय अपनी माता को देते थे। उनका कहना था उनकी माता ने ही उन्हें अच्छे-बुरे को समझने की शिक्षा दी। उन्होंने एक बार कहा था कि “पढाई के प्रति मेरे रुझान को देखते हुए मेरी माँ ने मेरे लिये छोटा सा लैम्प खरीदा था, जिससे मैं रात को 11 बजे तक पढ सकता था। माँ ने अगर साथ न दिया होता तो मैं यहां तक न पहुचता।”\n" +
                "15. अब्दुल कलाम जी को “ People's President” भी कहा जाता था। क्योंकि वे आम लोगों से काफी नजदीकी रिश्ता बनाकर रखते थे।\n" +
                "16. अब्दुलकलाम जी ने एक बार कहा था कि किताबें उनकी प्रिय मित्र हैं। और उनके घर में लाइब्रेरी है, जिसमें हजारों पुस्तकें हैं। वह किताबें उनकी सबसे बड़ी संपदा(property) है।\n" +
                "17. एक समय रामेश्वरम में अब्दुल कलाम के दोस्त \"ज़लालुद्दीन\" अकेले ऐसे व्यक्ति थे, जो इंग्लिश जानते थे। वह कलाम से 15 साल बड़े थे।\n" +
                "18. एक बार कलाम को 3 दिन के अंदर रॉकेट का रूप रेखा तैयार करने को कहा गया। ऐसा नहीं करने पर उनकी स्कालरशिप को रद्द कर देने की धमकी भी मिली,लेकिन कलाम उस कठिन प्रोजेक्ट को पूरा करने में ऐसे लग गए कि 3 दिन के बजाए मात्र 24 घंटे के अंदर उसे पूरा कर दिया।\n" +
                "19. सन् 1980 में कलाम की टीम ने रोहिणी उपग्रह को पृथ्वी की कक्षा में स्थापित कर भारत को International Space Club का सदस्य बना दिया था।\n" +
                "20. अब्दुल कलाम जी को Bharat Ratna (1997), Padma Vibhushan (1990),Padma Bhushan (1981),Indira Gandhi Award for National Integration (1997),Ramanujan Award (2000),King Charles II Medal (2007),International von Kármán Wings Award (2009),Hoover Medal (2009) समेत कई पुरुस्कार मिल चुके है।\n" +
                "21. वैसे अब्दुल कलाम जी युवाओं और बच्चों के बीच आज भी लोकप्रिय है। यही वजह है कि सन् 2003 और सन् 2006 में उन्हें MTV ने यूथ ऑइकन ऑफ दि ईयर नॉमिनेट किया था।\n" +
                "22. अब्दुल कलाम जी को संगीत से खासा लगाव था।\n" +
                "23. अब्दुल कलाम \"गीता\" और \"कुरआन\" दोनों पढ़ा करते थे।\n" +
                "24. अब्दुल कलाम को आज भी \" मिसाइल मैन \" के नाम से जाना जाता है।\n" +
                "25. भारत के राष्ट्रपति डॉ.अब्दुल कलाम 26 मई 2006 को जब स्विट्ज़रलैंड की यात्रा पर वहां पहुंचे, तो स्विट्ज़रलैंड सरकार ने उस दिन को “विज्ञान दिवस” घोषित किया, जो डॉ.आज़ाद को समर्पित है।\n" +
                "26. एक कार्यक्रम को संबोधित करते हुए अब्दुल कलाम जी ने अपने जीवन के सबसे बड़े अफसोस का जिक्र किया था और कहा था कि वह अपने माता पिता को उनके जीवनकाल में 24 घंटे बिजली उपलब्ध नहीं करा सके। यही उनका सबसे बड़ा अफ़सोस है।\n" +
                "27. भारत को सुरक्षित बनाने की दृष्टि से अब्दुल कलाम ने पृथ्वी,अग्नि जैसी कई मिसाइल भारत को दी है और आज इन मिसाइलो के बगैर भारत कुछ भी नहीं है।\n" +
                "28. वैसे तो कलाम साहब की कमाई बहुत हुई थी लेकिन उनकी जायदाद बहुत कम थी। क्योकि वह ज्यादातर हिस्सा दान कर दिया करते थे।\n" +
                "29. अब्दुल कलाम जी को सैंकड़ो बच्चे हर रोज़ पत्र लिखते थे और वह लगभग हर पत्र का उत्तर देने का प्रयास करते थे।\n" +
                "30. नरेंद्र मोदी समेत कई बड़ी-बड़ी हस्तियाँ कलाम को अपना आदर्श मानती है।";
        callActivity();
    }


    public void showAirland(View v){
        topic= "Airland";
        data= "1. आयरलैंड को करीब 9,000 साल पहले खोजा गया था।\n" +
                "2. सन् 1840 में आयरलैंड में भुखमरी से करीब 10,00000 लोगो की जान गई थी। और 1 मिलियन से भी ज़्यादा लोगो ने इस देश को छोड़ दिया था।\n" +
                "3. आयरलैंड यूरोप का तीसरा सबसे बड़ा द्वीप है और दुनिया में बीसवा सबसे बड़ा द्वीप है।\n" +
                "4. अमेरिका का मशहूर त्यौहार \"Halloween\" आयरलैंड में ही जन्मा है।\n" +
                "5. सन् 2011 में आयरलैंड की जनसंख्या 6.4 मिलियन थी तब आयरलैंड यूरोपीय देशों में ब्रिटेन के बाद दूसरा सबसे ज्यादा जनसंख्या वाला देश था।\n" +
                "6. आयरलैंड में मानव जाति के होने के सबूत मिले है जो 12800 ई.पू. से भी पहले के हैं।\n" +
                "7. आप यकीन नहीं करेंगे मगर आयरलैंड का \"Sean’s Bar\"सन् 900 में खुला था और यह आज भी चल रहा हैं। और काफी प्रचलित भी है।\n" +
                "8. मशहूर \"टाइटैनिक\" जहाज, आयरलैंड के ही \"बेलफ़ास्ट\" शहर में बना था।\n" +
                "9. आयरलैंड में इतनी ठंड रहती है कि वहाँ पर सांप नहीं पाए जाते है।\n" +
                "10. सन् 1845 से सन् 1852 तक पड़े अकाल ने आयरलैंड को हिला कर रख दिया था। अकाल से पहले यहां की जनसंख्यां 80 लाख थी और आज 64 लाख हैं।\n" +
                "11. आप शायद हंसेंगे लेकिन आयरलैंड में आदमियों से ज्यादा मोबाइल फोन हैं।\n" +
                "12. दुनिया का सबसे पुराना “नौका क्लब” सन् 1720 में आयरलैंड में ही खुला था।\n" +
                "13. आयरलैंड इकलौता ऐसा देश हैं जिसका राष्ट्रीय चिन्ह एक Musical Instrument हैं।\n" +
                "14. आयरलैंड में 36,00,000 लोग चश्में पहनते हैं।\n" +
                "15. Europian Union में आयरलैंड एकमात्र ऐसा देश हैं जहाँ गर्भपात कराना गैर कानूनी हैं।\n" +
                "16. आयरलैंड के 90% लोग कैथोलिक धर्म के मानने वाले हैं लेकिन 30% ही लोग ऐसे हे जो कभी चर्च गए हो।\n" +
                "17. आयरिश लोग आयरलैंड में कम और आयरलैंड से बाहर ज़्यादा रहते है।\n" +
                "18. आपको अगर आयरलैंड का बेस्ट सेलर बनना है तो आपको अपनी किताब के सिर्फ 3,000 कॉपीज बेचने पड़ेंगे।\n" +
                "19. आयरलैंड में आज तक किसी भी गाने की 5,000 कॉपीज भी नहीं बिकी।\n" +
                "20. एक सर्वे में अमेरिका के 73% लोग आयरलैंड को दुनिया के नक्शे पर नही ढूंढ पाए थे।\n" +
                "21. आपको शायद ही पता होंगा लेकिन अर्ज़ेंटीना की नेवी एक आयरिश व्यक्ति की देन हैं।\n" +
                "22. आयरलैंड एक ऐसा देश है जहाँ \"Gay Marriage\" पर कोई रोक नहीं है।\n" +
                "23. आयरलैंड की 70% शादीशुदा महिलाओं का अफेयर(Affair) है। अब आप बोलेंगे सच में क्या?\n" +
                "24. आयरलैंड में सिर्फ 10% लोग ही इंग्लिश बोलते है।\n" +
                "25. आयरलैंड छोड़कर जाने वाले अधिकतर लोग अमेरिका में ही रहते है।\n" +
                "26. आयरलैंड की नागरिकता पाने के लिए आपको वहाँ पर जन्म लेना या वहाँ रहना जरूरी नहीं है। अगर आपके दादा या दादी भी वहां के हो तो भी आपको वहाँ की नागरिकता मिल सकती है।\n" +
                "27. आयरलैंड में \"Happy Hours\" पूरी तरह से बैन है।\n" +
                "28. अमेरिका के वाइट हाउस का नाम तो आपने सुना ही होंगा उसे \"James Hoban\" ने डिजाईन किया था और वह एक आयरिश मैन थे।";
        callActivity();
    }

    public void showWhatsapp( View v){
        topic= "Whatsapp";
        data= "1 . आज के समय में पांचवा सबसे ज्यादा डाउनलोड किया जाने वाले app को Jan Koum और Brian Acton ने 2009 में बनाया था और जनवरी 2010 में रिलीज़ किया था।\n" +
                "2 . फरवरी 2016 में Whatsapp के एक बिलियन users थे इतने सारे users की वजह से ये मेसेजिंग के लिए सबसे ज्यादा इस्तेमाल किया जाने वाला app है।\n" +
                "3 .19 February, 2014 में facebook ने whatsapp को 19.3 बिलियन डॉलर में खरीद लिया था।\n" +
                "4 . पूरी दुनिया में whatsapp के सबसे ज्यादा users भारत में ही है।\n" +
                "5 . whatsapp आज की तारीख में बहुत लोकप्रिय हो चूका है मगर whatsapp ने इसके विज्ञापन के लिए अभी तक एक पैसा भी खर्च नहीं किया है।\n" +
                "6 . Jan Koum और Brian Acton पहले yahoo कंपनी में काम करते थे फिर उन्होंने 2007 में yahoo में इस्तीफा देने के बाद facbook में नौकरी के लिए अप्लाई किया मगर उन्हें नौकरी नहीं मिली थी।\n" +
                "7 . हर दिन एक मिलियन से ज्यादा users whasapp पर जुड़ते है।\n" +
                "8 . whatsapp के केवल 55 कर्मचारी है जिसमे से 34 इंजीनियर्स है जो मिलकर पुरे users को हैंडल करते है।\n" +
                "9 . फरबरी 2015 में global brands की रैंकिंग में whatsapp छठे नंबर पर थे।\n" +
                "10 . whatsapp पर 100 करोड़ से ज्यादा ग्रुप बने हुए है।\n" +
                "11 . एक औसतन whatsapp user एक महीने में 1000 से भी ज्यादा मैसेज भेजता है।\n" +
                "12 . social मीडिया पर जितनी भी selfies शेयर की जाती है उसमे से 27% whatsapp के जरिये शेयर होती है।\n" +
                "13 . whatsapp के संस्थापक जैन कॉम बहुत गरीब परिवार के थे लकिन आज के समय में वो अरबपति है।\n" +
                "14 . whatsapp ने अबतक की कम्पनीज में सबसे ज्यादा तेजी से growth किया है।\n" +
                "15 . 9 May , 2014 को ईरान की सरकार ने अपने देश में whatsapp को बैन कर दिया था।\n" +
                "16 . 2015 में कंपनी ने whatsapp को paid कर दिया था लेकिन 18 जनवरी 2016 में कंपनी ने फिर से इसे फ्री कर दिया क्योंकि अधिकतर users के पास भुगतान करने के लिए क्रेडिट कार्ड नहीं थे।\n" +
                "17 . whatsapp कुल 53 भाषाओं में उपलब्ध है।\n" +
                "18 . whatsapp का एक साल का टर्नओवर NASA के एक साल के बजट से भी ज्यादा है।\n" +
                "19 . Mcafee एंटीवायरस के अनुसार whatsapp बहुत ज्यादा secure है।\n" +
                "20 . whatsapp की कमाई जमैका, आइसलैंड और उत्तरी कोरिया जैसे देशो की कुल जीडीपी से भी ज्यादा है।";
        callActivity();
    }


    public void showBill( View v){
        topic= "Bill Gates";
        data= "1. बिल गेट्स का पूरा नाम विलियम हेनरी गेट्स तृतीय है।\n" +
                "2. बिल गेट्स सन् 1977 में रेड लाइट जंप करने और बिना ड्राइविंग लाइसेंस के कार चलाने के जुर्म में जेल की हवा खा चुके है।\n" +
                "3. बिल गेट्स ने अपना पहला प्रोग्राम केवल 17 वर्ष की आयु में बेचा था जो कि उनके स्कूल के लिए टाइम टेबल का एक सिस्टम था।\n" +
                "4. बिल गेट्स हर सेकेंड करीब 250 डॉलर कमाते हैं यानी एक दिन में 20 मिलियन डॉलर।\n" +
                "5. ऐसा माना गया है कि यदि बिल गेट्स पूरी दुनियां में प्रत्\u200Dयेक व्\u200Dयक्ति को 821रुपए दे तब भी उनके पास 27,3975000 रुपए बच जाएंगे।\n" +
                "6. अगर बिल गेट्स का कोई अपना एक अलग देश होता तो पूरी दुनिया में वो 37वा सबसे अमीर देश होता।\n" +
                "7. बिल गेट्स का घर 66,000 वर्ग मीटर में फैला हुआ है। यह वॉशिगटन झील के किनारे बना है। ज़ाहिर है यह घर अपनी डिजाइन, सुविधायों और तकनीक के लिए प्रसिद्ध है।\n" +
                "8. मिस्टर गेट्स की ‘Traff-O-Data’ नामक एक कंपनी थी जो ऐसे यंत्र बनाती थी जो कि सड़क पर स्थति किसी बिन्दु से गुजरने वाली कारों की गिणती रिकार्ड करते थे।\n" +
                "9. बिल गेट्स अगर अपनी सारी संपत्ति पूरी दुनिया में हर व्यकित को बराबर-बराबर रूपए में बाटें तो हर एक के हिस्से में करीब 4,983 रूपए आएगें।\n" +
                "10. आपको पता होंगा की अमरीका के सबसे महंगे एथलीट माइकल जार्डन है लेकिन अगर वह अपनी हर महीने की कमाई जरा सी भी खर्च न करें तो बिल गेट्स के बराबर पैसा इकट्टठा करने में उन्हें 277 साल लग जाएगे।\n" +
                "11. बिल गेट्स ने कंप्यूटर प्रोग्रामिंग का काम 13 वर्ष की आयु से ही शुरू कर दिया था।\n" +
                "12. आप शायद ही जानते होंगे कि बिल गेट्स को कंप्यूटर सॉफ्टवेर प्रोग्रामिंग से इतना प्यार था कि वह पढ़ाई छोड़ कर इस में ही लगे रहते थे जिसकी वजह से वह 11वीं में फेल हो गए थे।\n" +
                "13. ऐसा माना जाता है कि बिल गेट्स अपनी हाई स्कूल क्लास में लड़कों से ज्यादा लड़कियां चाहते थे। इसके लिए उन्होंने स्कूल का कंप्यूटर सिस्टम हैक कर लिया था।\n" +
                "14. बिल गेट्स ने पहला कंप्यूटर प्रोग्राम एक गेम बनाने के लिए इस्तेमाल किया था। जिसका नाम “Tic-Tac-Toe” गेम था । इसमें दो प्लेयर होते थे, एक कंप्यूटर और एक इंसान।\n" +
                "15. बिल ने सन् 1975 में हार्वर्ड युनिवर्सिटी को छोड़ दिया और पूरी तरह से माइक्रोसॉफ्ट को सफल बनाने में जुट गए । हालांकि 2007 में उसी हार्वर्ड यूनिवर्सिटी ने उन्हें डिग्री देकर सम्मानित किया।\n" +
                "16. सन् 1997 तक बिल एक आम आदमी की तरह ही उड़ान भरते थे। तब उनके पास अपन एक प्लेन था जिसे वह अपना ‘बड़ा फिजूलखर्च’ बताते थे।\n" +
                "17. बिल गेट्स अंग्रेजी के अलावा कोई और भाषा नहीं जानते। वह इसे अपने जीवन का सबसे बड़ा अफसोस मानते है।\n" +
                "18. आप यकीन नहीं करेंगे मगर \"महेन्द्र सिंह धोनी\" अगर अपना एक भी पैसा खर्च न करें तो उन्हें बिल गेट्स के बराबर पैसा इकट्टठा करने में 35,000 साल लग जाएगें। है न मज़ेदार बात ?\n" +
                "19. यकीन मानिये बिल गेट्स पूरे अमेरिका का कर्जा सिर्फ दस साल में उतार सकते हैं।\n" +
                "20. यदि बिल गेट्स 6.5 करोड़ रुपए रोज खर्च करे तो भी अपनी पूरी संपत्ति को खर्च करने में इन्हें 218 साल लगेंगे। आप सोच रहे होंगे की काश बिल गेट्स हमें भी कुछ दे दे ।\n" +
                "21. इतना अपार धन होने के बाबजूद बिल गेट्स ने अपने बच्चो को अपनी वसीयत में सिर्फ 10 मिलियन डॉलर देकर जायेंगे, जो इनकी अथाह दौलत अर्थात 810100 मिलियन डॉलर का सिर्फ एक बहुत ही छोटा सा हिस्सा है और इसके बारे में पूछे जाने पर गेट्स सिर्फ इतना कहते है की \"इतनी अधिक दौलत छोड़कर जाना मेरे बच्चो के लिए उचित नहीं है\" |\n" +
                "22. बिल गेट्स ने 30 साल की उम्र में यह इच्छा व्यक्त की थी की वह करोडपति बनना चाहते है लेकिन किस्मत देखिये सिर्फ 1 साल के बाद ही वह अरबपति बन गए।\n" +
                "23. क्या आप जानते है ? की यूनाइटेड नेशन पुरे साल में जितना खर्च करता है उससे अधिक सिर्फ गेट्स फाउंडेशन ही 1 साल में खर्च कर देता है।\n" +
                "24. गेट्स हर साल 6.4 करोड़ रूपए प्राॅपर्टी टैक्स के रूप में अदा करते है।\n" +
                "25. बिल गेट्स आज भी खाना खाकर अपनी प्लेट खुद ही साफ करते है। वे कहते है कि मुझे ये अच्छा लगता है।\n" +
                "26. बिल गेट्स अपनी पूरी ज़िन्दगी में 100 मिलियन डाॅलर दान करना चाहते है।\n" +
                "27. बिल गेट्स के पिता \"विलियम एच. गेट्स\" नामी वकील थे और बिल गेट्स के परदादा बैंक के मालिक थे।";
        callActivity();
    }


    public void showHitlar( View v){
        topic= "Hitlar";
        data= "1 . अडोल्फ हिटलर का जन्म आस्ट्रिया में 20 अप्रैल, 1889 को हुआ था।\n" +
                "2 . हिटलर की मां क्लारा हिटलर गर्भपात कराना चाहती थी मगर डॉक्टर के मना करने पर बच्चे को जन्म दिया जो की दुनिया के सर्वाधिक घृणित व्यक्तियों में आता है।\n" +
                "3 . हिटलर के 6 भाई बहन थे जिनमे से 3 की मौत तो पचपन में ही हो गयी थी और एक की मौत 11 वर्ष की आयु में हुई थी।केवल हिटलर और उसकी बहन पौला ही जीवित रह पाए थे।\n" +
                "4 . हिटलर की माँ की मौत 1907 में हुई थी जब हिटलर 18 साल का था और उसके पिता की मौत 1903 में ही हो गई थी जब हिटलर 14 साल का था।\n" +
                "5 . 1905 में पढाई छोड़ने के बाद हिटलर ने \" स्कूल ऑफ़ आर्ट \" में प्रवेश के लिए दो बार कोशिश की मगर उसे दोनों बार निराशा मिली फिर हिटलर ने राजनीति की तरफ रुख किया था।\n" +
                "6 . हिटलर शाकाहारी था और उसके पास दो की वजाय सिर्फ एक अंडकोष था।\n" +
                "7 . हिटलर को 1923 में सरकार के विरुद्ध आवाज उठाने के लिए जेल में डाल दिया गया था। जेल में उसने Mein Kampf (My Struggle) किताब लिखी थी।\n" +
                "8 . 1945 में हिटलर की शादी ईवा ब्राउन से हुई थी।\n" +
                "9 . टाइम्स मैगजीन ने 1938 में हिटलर को मैन ऑफ़ दा ईयर के टाइटल से नवाजा था।\n" +
                "10 . हिटलर को चॉकलेट बहुत पसंद थी वो एक दिन में 900 ग्राम तक चॉकलेट खा जाता था।\n" +
                "11 . यहुदिओं पर हिटलर ने बहुत अत्याचार किया पर उसको जिस लड़की से पहला प्यार हुआ था वो एक यहूदी लड़की ही थी।\n" +
                "12 . हिटलर ने धूम्रपान और जानवरों की हत्या के खिलाफ सख्त कानून बनाए थे ।\n" +
                "13 . हिटलर की मूंछ को लोग ‘टुथब्रश की मुछें कहा करते थे।\n" +
                "14 हिटलर पेट में गैस की तकलीफ से परेशान था इसके इलाज के लिए उसे 28 तरह की दवाइया लेनी होती थी।\n" +
                "15 . पहले विश्व युद्ध के दौरान एक ब्रिटिश सैनिक ने जख्मी हिटलर को जिन्दा छोड़ दिया था।\n" +
                "16 . हिटलर जब 4 साल का था तो उसे एक पादरी ने डूबने से बचाया था।\n" +
                "17 . जब वो जेल में था तो उसने मर्सिडीज कार के डीलर से कार लोन लेने के लिए खत लिखा था।\n" +
                "18 . हिटलर को 1939 में नोबल शांति पुरष्कार के लिए नामांकित किया गया था।\n" +
                "19 . बचपन में हिटलर पुजारी बनना चाहता था लेकिन वो तानाशाह बन गया।\n" +
                "20 . हिटलर को कार चलानी नहीं आती थी मगर उसने आधुनिक समय की नामी कार कंपनी फोक्सवैगन कार के निर्माण की अगुआई की थी।";
        callActivity();
    }

    public void showGandhiJi( View v){
        topic= "Mahatama Gandhi Ji";
        data= "1. एक बार गांधी जी के पास टिकट होने के बावजूद एक अंग्रेज टिकट कलेक्टर(TC) ने “काला” होने के कारण ट्रेन से धक्का मार कर उतार दिया था। यह उनका किसी अंग्रेज के साथ सबसे कड़वा अनुभव था।\n" +
                "2. गाँधी जी अपने हिटलर को अक्सर पत्र लिखते थे और उनका समर्थन भी करते थे।\n" +
                "3. गाँधी जी ने जब अपनी कानून की पढ़ाई ख़त्म कर इंग्लैंड में अपनी वकालत शुरू की थी तब वह पूरी तरह असफल हुए यहाँ तक की उनके पहले केस में उनकी टाँगे कॉप रही थी और वह पूरी बहस किये बिना ही बैठ गए थे और केस हार गए।\n" +
                "4. एक बार गाँधी जी का जूता चलती हुई ट्रैन में से नीचे गिर गया। उन्होंने फ़ौरन ही दूसरा जूता निकाल कर चलती ट्रेन से नीचे फैक दिया। पूछने पर बताया कि \" एक जूता ना तो मेरे काम आएगा और ना ही उसके जिसे मेरा दूसरा जूता मिलेगा कम से कम उसके काम तो आयेगा जिसे मेरे दोनों जूते मिलेंगे\" ।\n" +
                "5. आपको यकीन नहीं होंगा मगर गांधी जी के बेटे ने उन्हें छोड़ दिया था और इस्लाम धर्म भी अपना लिया था।\n" +
                "6. सन् 1930 में उन्हें अमेरिका की टाइम मैगजीन ने \"Man of the year\" पुरुस्कार से नवाजा था।\n" +
                "7. महात्मा गांधी जन्म से बोल्ड और बहादुर नेता नही थे। बल्कि उन्होंने अपनी आत्म कथा पर लिखा है कि बचपन में वो इतने शर्मीले थे वो स्कूल से भाग जाते थे ताकि उन्हें किसी से बात इस करना पड़े।\n" +
                "8. आपको शायद ही पता होंगा लेकिन यह सच है कि गांधी जी अपनी पत्नी से अक्सर मारपीट करते थे। उन्होंने दशकों तक उनके साथ शारीरिक संबंध भी नहीं रखे।\n" +
                "9. संयुक्त राष्ट्र ने गांधी जी के जन्म दिन 2 अक्टूबर को विश्व अहिंसा दिवस (world non-violence day) घोषित किया है।\n" +
                "10. गाँधी जी चाहते तो भगत सिंह की फांसी रोक सकते थे पर कई लोगो का मानना था कि गाँधी जी ने भगत सिंह के केस पर कभी गंभीरता दिखाई ही नही।\n" +
                "11. महात्मा गांधी को 5 बार नोबेल शांति पुरूस्कार के लिए नामांकित किया गया था।\n" +
                "12. गांधी जी ने अंग्रेजो के खिलाफ लड़ाई लड़ी थी मगर अंग्रेजो के देश \"ब्रिटैन\"ने गांधी जी की मौत के 21 साल बाद उनके सम्मान में एक डाक टिकट जारी किया था।\n" +
                "13. महात्मा गांधी अपने पूरे जीवन में कभी अमेरिका नही गये। और ना ही कभी एरोप्लेन(aeroplane) में बैठे।\n" +
                "14. गाँधी जी को अपनी फोटो खिंचवाना बिलकुल पसंद नही था लेकिल आजादी की लड़ाई के दौरान वो अकेले शख्स थे जिनकी सबसे ज़्यादा फोटो ली गई थी।\n" +
                "15. गाँधी जी को सम्मान देने के लिए एप्पल के संस्थापक स्टीव जॉब्स गोल चश्मा पहनते थे।\n" +
                "16. महात्मा गांधी ने अपने जीवन में हर रोज़ करीब 18 किलोमीटर का सफर किया था। इस हिसाब से उन्होंने 2 बार पूरी दुनिया घूम ली थी।\n" +
                "17. गांधी जी अपने नकली दांत अपनी धोती में बाँध कर रखते थे। वह उन्हें केवल खाना खाते समय ही लगाया करते थे।\n" +
                "18. सन 1931 में जब गाँधी जी ने इंग्लैंड यात्रा के दौरान पहली बार अमेरिका के लिए भाषण दिया। रेडियो पर उनके पहले शब्द थे \"क्या मुझे इस माइक्रोफोन के अंदर बोलना पड़ेगा\" \"Do i have to speak into this thing\".\n" +
                "19. 1933 में गाँधी जी ने ‘हरिजन’ नाम का एक अखबार शुरु किया था।\n" +
                "20. भारत में 53 और पूरी दुनिया में 48 ऐसे छोटे-बड़े रोड है जिन्हें गांधी जी का नाम दिया गया है।\n" +
                "21. गांधी जी भले ही भारत में धोती पहनते मगर वकील बनने के बाद दक्षिण अफ्रीका में उनकी सालाना कमाई $15000 डॉलर थी।\n" +
                "22. महात्मा गांधी को महात्मा की उपाधि रविंद्र नाथ टैगोर ने दी थी। और रविंद्र नाथ को गुरूदेव की उपाधि महात्मा गांधी ने दी थी।\n" +
                "23. भारत की स्वंत्रता प्राप्ति के पश्चात कुछ पत्रकार गाँधी जी के पास आए और उनसे अंग्रेजी में बात करने लगे। मगर गाँधी जी ने सभी को रोका और कहा कि, “मेरा देश अब आजाद हो गया है, अब मैं हमारी हिन्दी भाषा ही बोलूँगा।\"\n" +
                "24. 1999 में गांधी जी को Times Magzine द्वारा Albert Einstein के बाद 19वीं सदी का दूसरा सबसे प्रभावशाली व्यक्ति चुना गया। और वे इसके हक़दार भी थे।\n" +
                "25. अपनी मौत के एक दिन पहले गाँधी जी congress party को ख़त्म करने का विचार कर रहे थे।\n" +
                "26. गांधी जी की मृत्यु पर पंडित नेहरु जी ने रेडियो द्वारा राष्ट्र को संबोधित किया और कहा की “राष्ट्रपिता अब नहीं रहे“। तब जाकर पुरे देश में मालुम पड़ा की महात्मा गांधी नहीं रहे।\n" +
                "27. गांधी जी की शव यात्रा 8 किलोमीटर लंबी थी।\n" +
                "28. गांधी जी की शवयात्रा को आजाद भारत की सबसे बड़ी शवयात्रा कहा गया था। करीब दस लाख लोग साथ चल रहे थे और करीब 15 लाख लोग रास्ते में खड़े थे। यहां तक की लोग खंभो पर भी चढ़ गए थे।\n" +
                "29. जब गांधी जी को गोली मार दी गई थी उस समय उन्होंने जो कपडे पहने थे वह कपडे आज भी गांधी संग्रहालय में सुरक्षित रखे हुए है।";
        callActivity();
    }



    public void callActivity(){
        Intent i= new Intent(this, ShowDataAC.class);
        i.putExtra("topic",topic);
        i.putExtra("data",data);
        this.startActivity(i);
    }



    public void showAbout(View v){
        Intent i= new Intent (this,AboutAC.class);
        this.startActivity(i);
    }



}//class END

